#ifndef _LCD_H_
#define _LCD_H_

/*===============================================================
関数名:	LcdCls
機能:		LCDの表示をクリアする
===============================================================*/
extern void LcdCls(void);

/*===============================================================
関数名:	LcdDisplayMode
機能:		LCDの表示モードを設定する
			disp: LCD全体の表示のON/OFF
			cursor: カーソル表示のON/OFF
			blink: カーソル位置の文字のブリンクのON/OFF
===============================================================*/
extern void LcdDisplayMode(char disp, char cursor, char blink);

/*===============================================================
関数名:	LcdInit
機能:		LCDの初期化. 起動時に一回だけ呼び出す.
===============================================================*/
extern void LcdInit(void);
extern void lcd_write(char reg, char dat);

/*===============================================================
関数名:	LcdPutc
機能:		現在設定されているLCDのDDRAMアドレスへ1文字出力する.
===============================================================*/
extern void LcdPuts(char *str);

/*===============================================================
関数名:	LcdXy
機能:		引数 x, y で示された位置へ文字列sを表示する.
===============================================================*/
extern void LcdXy(char x, char y);

#endif /*end of #ifndef _LCD_H_*/
